#Задание 1 Напишите программу, которая спрашивает у пользователя два слова и выводит их разделёнными запятой.

a = input('Введите первое слово: ')
b = input('Введите второе слово: ')
print(a,',', b)

# а как сделать что бы вводилось два слова подряд, а выводились через запятую?