# Напишите программу, которая запрашивает у пользователя радиус круга и выводит его площадь.
import math
r = float(input('Введите радиус: '))
print('Площадь круга: S = ', math.pi * pow(r,2))

