#Задание 3 Напишите программу, которая решает квадратное уравнение 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0 по формулам
#Значения a, b и c вводятся с клавиатуры. Для извлечения корня используйте оператор возведения в степень,
# а не функцию math.sqrt, чтобы получить комплексные числа в случае, если подкоренное выражение отрицательно.

a = float(input('a = '))
b = float(input('b = '))
c = float(input('c = '))

x1 = (-b + pow((pow(b,2) - 4 * a * c), 0.5)) / (2 * a)

x2 = (-b - pow((pow(b,2) - 4 * a * c), 0.5)) / (2 * a)

print('x1 = ',x1, ',', 'x2 = ', x2)


