# Напишите программу-калькулятор, в которой пользователь сможет ввести тип операции,
# ввести необходимые числа и получить результат. Операции, которые необходимо реализовать:
# сложение,  вычитание,  умножение,  деление,  возведение  в  степень,  синус,  косинус  и  тангенс
# числа.

import math

print('''
Выберите необходимую операцию:
1. +
2. -
3. *
4. /
5. ^x
6. sin(a)
7. cos(a)
8. tg(a)
''')
oper = int(input('Выберите необходимую операцию: '))

a = float(input('Введите число а = '))
if oper in ('+', '-', '*', '/'):
    b = float(input('Введите число b = '))

if oper == 1:
    print('a + b = ', a + b)

elif oper == 2:
    print('а - b = ', a - b)

elif oper == 3:
    print('а * b = ', a * b)

elif oper == 4:
    print('а / b = ', a / b)

elif oper == 5:
    x = float(input('Введите степень: '))
    print('Возведение в степень a = ', pow(a,x))
elif oper == 6:
    print('sin(a) = ', math.sin(a))
elif oper == 7:
    print('cos(a) = ', math.cos(a))
elif oper == 8:
    print('tg(a) = ', math.tan(a))
else:
    print('Некорректная операция')

# как не задавать число b, если это не первые 4 пункта?
# if oper == 1 or 2 or 3 or 4:
#  b = float(input('Введите число b = '))
# где здесь можно применить тернарный оператор?не могу найти
