# Напишите  программу,  которая  определяет,  что  за  зверь  находится  перед  вами.  Если  зверь
# говорит  “Meow”,  то  это  кошка,  если  “Bark”,  то  это  собака,  а  если  что-то  другое,  то  это
# “Неизвестный зверь”.

anim = int(input('''
Что вы слышите? 
1 - Meow
2 - Bark
3 - Another sound
'''))
a = 1
b = 2

if anim == 1:
    print('Это Кошка')
elif anim == 2:
    print('Это Собака')

else:
    print('Неизвестний зверь')

