# Создайте  программу-калькулятор,  которая  поддерживает  четыре  операции:  сложение,
# вычитание, умножение, деление. Все данные должны вводиться в цикле, пока пользователь не
# укажет,  что  хочет  завершить  выполнение  программы.  Каждая  операция  должна  быть
# реализована  в  виде  отдельной  функции.  Функция  деления  должна  проверять  данные  на
# корректность и выдавать сообщение об ошибке в случае попытки деления на ноль.


def choose_operation( oper):
    print('''
              Выберите необходимую операцию:
               1. +
               2. -
               3. *
               4. / 
               ''')
    oper = int(input('Выберите необходимую операцию: '))


def summ():
    print('a + b = ', a + b)


def subtract():
    print('а - b = ', a - b)


def multiplicate():
    print('а * b = ', a * b)


def divide():
    print('Деление на ноль') if b == 0 else print('а / b = ', a / b)


def uncorrect():
    if not choose_operation:
      print('Некорректная операция')


def main():
    choose_operation()
    oper = int(input('Выберите необходимую операцию: '))
a = float(input('Введите число а = '))
b = float(input('Введите число b = '))
    if choose_operation():
       def summ()


if __name__ == '__main__':
    main()